In [9]:
import pandas as pd

Pandas has Series and DataFrames
- Series: like an array
- DataFrame: like a 2d array (matrix, having rows and cols)

In [10]:
data = {
    "name": ["rahul", "vidu", "vishnu"],
    "marks": [100, 98, 78],
    "age": [22, 21, 10],
}

df = pd.DataFrame(data, index=[90, 91, 93])
df
df.loc[90]  # exact index label
df.iloc[0]  # positional index (0, 1, 2, ...)

      name  marks  age
90   rahul    100   22
91    vidu     98   21
93  vishnu     78   10

name     rahul
marks      100
age         22
Name: 90, dtype: object

name     rahul
marks      100
age         22
Name: 90, dtype: object

In [11]:
df = pd.DataFrame(data)

In [12]:
df.index
df.columns
df.values

RangeIndex(start=0, stop=3, step=1)

Index(['name', 'marks', 'age'], dtype='object')

array([['rahul', 100, 22],
       ['vidu', 98, 21],
       ['vishnu', 78, 10]], dtype=object)

In [13]:
df['name']
type(df['name'])

0     rahul
1      vidu
2    vishnu
Name: name, dtype: object

pandas.core.series.Series

In [14]:
df[['name', 'marks']]
type(df[['name', 'marks']])

     name  marks
0   rahul    100
1    vidu     98
2  vishnu     78

pandas.core.frame.DataFrame

In [15]:
df['name'][0]
df['name'][0:2]

'rahul'

0    rahul
1     vidu
Name: name, dtype: object

In [16]:
# df.loc[row_label, col_label] -> Scalar/Series/Df
# label: scalar, list, range
df.loc[0]
df.loc[0, 'name']
df.loc[0, ['name', 'age']]
df.loc[0:2, ['name', 'age']]
df.loc[0:2, 'name':'age']
df.loc[[0, 2], 'name':'age']

name     rahul
marks      100
age         22
Name: 0, dtype: object

'rahul'

name    rahul
age        22
Name: 0, dtype: object

     name  age
0   rahul   22
1    vidu   21
2  vishnu   10

     name  marks  age
0   rahul    100   22
1    vidu     98   21
2  vishnu     78   10

     name  marks  age
0   rahul    100   22
2  vishnu     78   10

In [17]:
# same as .loc but labels can only be numeric
df.iloc[0]
df.iloc[0, 0]  # df.iloc[0, 'name']
df.iloc[0, :2]
df.iloc[:, :2]

name     rahul
marks      100
age         22
Name: 0, dtype: object

'rahul'

name     rahul
marks      100
Name: 0, dtype: object

     name  marks
0   rahul    100
1    vidu     98
2  vishnu     78

In [18]:
df = pd.read_csv('data/customers-100.csv', index_col="Index")
df

,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
Index,,,,,,,,,,,
1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/
4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/
5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/
...,...,...,...,...,...,...,...,...,...,...,...
96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,2022-01-30,http://hayes-perez.com/
97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,+1-846-706-2218,605.413.3198,vkemp@ferrell.com,2021-07-10,https://novak-allison.com/
98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,2021-09-18,https://www.ross.com/
99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,2021-08-11,http://watkins.info/
100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/

In [19]:
df.columns
df.index

Index(['Customer Id', 'First Name', 'Last Name', 'Company', 'City', 'Country',
       'Phone 1', 'Phone 2', 'Email', 'Subscription Date', 'Website'],
      dtype='object')

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,  14,
        15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,  27,  28,
        29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,  40,  41,  42,
        43,  44,  45,  46,  47,  48,  49,  50,  51,  52,  53,  54,  55,  56,
        57,  58,  59,  60,  61,  62,  63,  64,  65,  66,  67,  68,  69,  70,
        71,  72,  73,  74,  75,  76,  77,  78,  79,  80,  81,  82,  83,  84,
        85,  86,  87,  88,  89,  90,  91,  92,  93,  94,  95,  96,  97,  98,
        99, 100],
      dtype='int64', name='Index')

In [20]:
df['City']
df[['City', 'First Name']]

Index
1           East Leonard
2      East Jimmychester
3          Isabelborough
4             Bensonview
5         West Priscilla
             ...
96          East Richard
97          New Bradview
98            Ortegaland
99       Lake Elijahview
100            Judymouth
Name: City, Length: 100, dtype: object

                    City First Name
Index
1           East Leonard     Sheryl
2      East Jimmychester    Preston
3          Isabelborough        Roy
4             Bensonview      Linda
5         West Priscilla     Joanna
...                  ...        ...
96          East Richard       Karl
97          New Bradview       Lynn
98            Ortegaland       Fred
99       Lake Elijahview     Yvonne
100            Judymouth   Clarence

[100 rows x 2 columns]

In [21]:
df = pd.read_json('data/64KB.json')
df

,name,language,id,bio,version
0,Adeel Solangi,Sindhi,V59OF92YF627HFY0,Donec lobortis eleifend condimentum. Cras dict...,6.10
1,Afzal Ghaffar,Sindhi,ENTOCR13RSCLZ6KU,"Aliquam sollicitudin ante ligula, eget malesua...",1.88
2,Aamir Solangi,Sindhi,IAKPO3R4761JDRVG,Vestibulum pharetra libero et velit gravida eu...,7.27
3,Abla Dilmurat,Uyghur,5ZVOEPMJUI4MB4EN,Donec lobortis eleifend condimentum. Morbi ac ...,2.53
4,Adil Eli,Uyghur,6VTI8X6LL0MMPJCC,"Vivamus id faucibus velit, id posuere leo. Mor...",6.49
...,...,...,...,...,...
192,Kristín Sigurðardóttir,Icelandic,ZP5TBBYX6RI2UJ31,Cras dictum dolor lacinia lectus vehicula rutr...,2.80
193,Rohini Vasav,Hindi,UEFML43TCGS04KWM,"Ut accumsan, est vel fringilla varius, purus a...",9.30
194,Sunil Kapoor,Hindi,VY2A0APGVHK5NAW2,"Proin tempus eu risus nec mattis. Ut dictum, l...",8.04
195,Zamokuhle Zulu,isiZulu,XU7BX2F8M5PVZ1EF,Etiam congue dignissim volutpat. Phasellus tin...,8.39
196,Bhupesh Menon,Hindi,0CEPNRDV98KT3ORP,Maecenas tempus neque ut porttitor malesuada. ...,2.69

In [22]:
df = pd.read_csv('data/customers-100.csv', index_col='Index')
df.head(1)
df.tail(1)
df.sample(1)

,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
Index,,,,,,,,,,,
1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/

,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
Index,,,,,,,,,,,
100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/

,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
Index,,,,,,,,,,,
11,216E205d6eBb815,Carl,Schroeder,"Oconnell, Meza and Everett",Shannonville,Guernsey,637-854-0256x825,114.336.0784x788,kirksalas@webb.com,2021-10-20,https://simmons-hurley.com/

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 1 to 100
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Customer Id        100 non-null    object
 1   First Name         100 non-null    object
 2   Last Name          100 non-null    object
 3   Company            100 non-null    object
 4   City               100 non-null    object
 5   Country            100 non-null    object
 6   Phone 1            100 non-null    object
 7   Phone 2            100 non-null    object
 8   Email              100 non-null    object
 9   Subscription Date  100 non-null    object
 10  Website            100 non-null    object
dtypes: object(11)
memory usage: 9.4+ KB

In [24]:
df.describe()

,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
count,100,100,100,100,100,100,100,100,100,100,100
unique,100,93,97,99,100,85,100,100,100,96,100
top,DD37Cf93aecA6Dc,Sheryl,Foley,Simon LLC,East Leonard,Solomon Islands,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2021-04-23,http://www.stephenson.com/
freq,1,2,2,2,1,4,1,1,1,2,1

In [25]:
df['Country'].value_counts()

Country
Solomon Islands       4
Sri Lanka             2
Oman                  2
Togo                  2
Dominican Republic    2
                     ..
Anguilla              1
Mali                  1
Guyana                1
Aruba                 1
Honduras              1
Name: count, Length: 85, dtype: int64

In [26]:
url = 'https://en.wikipedia.org/wiki/List_of_countries_by_population_(United_Nations)'

# Pass the 'User-Agent' header to mimic a browser
tables = pd.read_html(
    url,
    storage_options={'User-Agent': 'Mozilla/5.0'}
)

df_population = tables[0]
df_population

,Country or territory,Population (1 July 2022),Population (1 July 2023),Change (%),UN continental region[1],UN statistical subregion[1]
0,World,8021407192,8091734930,+0.88%,–,–
1,India,1425423212,1438069596,+0.89%,Asia,Southern Asia
2,China[a],1425179569,1422584933,−0.18%,Asia,Eastern Asia
3,United States,341534046,343477335,+0.57%,Americas,Northern America
4,Indonesia,278830529,281190067,+0.85%,Asia,South-eastern Asia
...,...,...,...,...,...,...
233,Montserrat (United Kingdom),4453,4420,−0.74%,Americas,Caribbean
234,Falkland Islands (United Kingdom),3490,3477,−0.37%,Americas,South America
235,Tokelau (New Zealand),2290,2397,+4.67%,Oceania,Polynesia
236,Niue,1821,1817,−0.22%,Oceania,Polynesia
237,Vatican City[w],505,496,−1.78%,Europe,Southern Europe

In [27]:
mask = df_population['Population (1 July 2022)'] < 10_000
mask.sum()
df_population[mask]

mask2 = mask & (df_population['UN continental region[1]'] == 'Americas')
df_population[mask2]

np.int64(8)

,Country or territory,Population (1 July 2022),Population (1 July 2023),Change (%),UN continental region[1],UN statistical subregion[1]
230,Tuvalu,9992,9816,−1.76%,Oceania,Polynesia
231,Saint Pierre and Miquelon (France),5732,5681,−0.89%,Americas,Northern America
232,Saint Helena (United Kingdom)[v],5343,5289,−1.01%,Africa,Western Africa
233,Montserrat (United Kingdom),4453,4420,−0.74%,Americas,Caribbean
234,Falkland Islands (United Kingdom),3490,3477,−0.37%,Americas,South America
235,Tokelau (New Zealand),2290,2397,+4.67%,Oceania,Polynesia
236,Niue,1821,1817,−0.22%,Oceania,Polynesia
237,Vatican City[w],505,496,−1.78%,Europe,Southern Europe

,Country or territory,Population (1 July 2022),Population (1 July 2023),Change (%),UN continental region[1],UN statistical subregion[1]
231,Saint Pierre and Miquelon (France),5732,5681,−0.89%,Americas,Northern America
233,Montserrat (United Kingdom),4453,4420,−0.74%,Americas,Caribbean
234,Falkland Islands (United Kingdom),3490,3477,−0.37%,Americas,South America

In [42]:
df.query('Country == "Solomon Islands" and City == "Frankchester"')

,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
Index,,,,,,,,,,,
94,54B5B5Fe9F1B6C5,Sherry,Young,"Lee, Lucero and Johnson",Frankchester,Solomon Islands,158-687-1764,(438)375-6207x003,alan79@gates-mclaughlin.com,2021-04-04,https://travis.net/

In [49]:
df = pd.DataFrame({
    "name": ['rahul', 'vidu', 'vishnu', 'paru', 'maa', 'papa', None],
    "age": [22, 21, None, 15, 42, 48, None],
    "height": [None, 150, 120, 165, 155, None, None]
})

df
df.info()
df.isnull().sum()

     name   age  height
0   rahul  22.0     NaN
1    vidu  21.0   150.0
2  vishnu   NaN   120.0
3    paru  15.0   165.0
4     maa  42.0   155.0
5    papa  48.0     NaN
6    None   NaN     NaN

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     5 non-null      float64
 2   height  4 non-null      float64
dtypes: float64(2), object(1)
memory usage: 300.0+ bytes

name      1
age       2
height    3
dtype: int64

In [55]:
df
df.dropna() # inplace=True
df.fillna(0)

     name   age  height
0   rahul  22.0     NaN
1    vidu  21.0   150.0
2  vishnu   NaN   120.0
3    paru  15.0   165.0
4     maa  42.0   155.0
5    papa  48.0     NaN
6    None   NaN     NaN

   name   age  height
1  vidu  21.0   150.0
3  paru  15.0   165.0
4   maa  42.0   155.0

     name   age  height
0   rahul  22.0     0.0
1    vidu  21.0   150.0
2  vishnu   0.0   120.0
3    paru  15.0   165.0
4     maa  42.0   155.0
5    papa  48.0     0.0
6       0   0.0     0.0

In [67]:
df['name'].fillna('Unknown')

0      rahul
1       vidu
2     vishnu
3       paru
4        maa
5       papa
6    Unknown
Name: name, dtype: object

In [68]:
df.iloc[:, 1:].fillna(0)

df.iloc[:, 1:].fillna({
    "age": 20,
    "height": 150
})

df.iloc[:, 1:].fillna({
    "age": df['age'].mean(),
    "height": df['height'].mean(),
})

    age  height
0  22.0     0.0
1  21.0   150.0
2   0.0   120.0
3  15.0   165.0
4  42.0   155.0
5  48.0     0.0
6   0.0     0.0

    age  height
0  22.0   150.0
1  21.0   150.0
2  20.0   120.0
3  15.0   165.0
4  42.0   155.0
5  48.0   150.0
6  20.0   150.0

    age  height
0  22.0   147.5
1  21.0   150.0
2  29.6   120.0
3  15.0   165.0
4  42.0   155.0
5  48.0   147.5
6  29.6   147.5

In [71]:
df['power'] = 10
df

     name   age  height  power
0   rahul  22.0     NaN     10
1    vidu  21.0   150.0     10
2  vishnu   NaN   120.0     10
3    paru  15.0   165.0     10
4     maa  42.0   155.0     10
5    papa  48.0     NaN     10
6    None   NaN     NaN     10

In [72]:
df['power'] = df['age'] * df['height']
df

     name   age  height   power
0   rahul  22.0     NaN     NaN
1    vidu  21.0   150.0  3150.0
2  vishnu   NaN   120.0     NaN
3    paru  15.0   165.0  2475.0
4     maa  42.0   155.0  6510.0
5    papa  48.0     NaN     NaN
6    None   NaN     NaN     NaN

In [77]:
df.columns
df.dtypes
df.select_dtypes(include=['number'])  # numeric cols
df.select_dtypes(include=['object'])  # categorical cols

Index(['name', 'age', 'height', 'power'], dtype='object')

name       object
age       float64
height    float64
power     float64
dtype: object

    age  height   power
0  22.0     NaN     NaN
1  21.0   150.0  3150.0
2   NaN   120.0     NaN
3  15.0   165.0  2475.0
4  42.0   155.0  6510.0
5  48.0     NaN     NaN
6   NaN     NaN     NaN

     name
0   rahul
1    vidu
2  vishnu
3    paru
4     maa
5    papa
6    None

In [80]:
df = pd.DataFrame({
    "name": ['rahul', 'harikesh', 'paru', 'vishnu', 'vidu'],
    "place": ['bhadohi', 'bhadohi', 'hbh', 'hbh', 'hbh'],
    "study": ['bsc', 'bsc', 'school', 'school', 'ba'],
    "salary": [200, 400, 100, 40, 302]
})

df

       name    place   study  salary
0     rahul  bhadohi     bsc     200
1  harikesh  bhadohi     bsc     400
2      paru      hbh  school     100
3    vishnu      hbh  school      40
4      vidu      hbh      ba     302

In [92]:
df.groupby('place').groups
df.groupby('study').groups
df.groupby('study').get_group('bsc')
df.groupby('study').get_group('school')

{'bhadohi': [0, 1], 'hbh': [2, 3, 4]}

{'ba': [4], 'bsc': [0, 1], 'school': [2, 3]}

       name    place study  salary
0     rahul  bhadohi   bsc     200
1  harikesh  bhadohi   bsc     400

     name place   study  salary
2    paru   hbh  school     100
3  vishnu   hbh  school      40

In [95]:
df
df.groupby('place')['salary'].mean()

       name    place   study  salary
0     rahul  bhadohi     bsc     200
1  harikesh  bhadohi     bsc     400
2      paru      hbh  school     100
3    vishnu      hbh  school      40
4      vidu      hbh      ba     302

place
bhadohi    300.000000
hbh        147.333333
Name: salary, dtype: float64

In [101]:
grouped = df.groupby('place')
for name, group in grouped:
  group

       name    place study  salary
0     rahul  bhadohi   bsc     200
1  harikesh  bhadohi   bsc     400

     name place   study  salary
2    paru   hbh  school     100
3  vishnu   hbh  school      40
4    vidu   hbh      ba     302

In [107]:
import seaborn as sns

In [108]:
df = sns.load_dataset('iris')
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [109]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [110]:
df = sns.load_dataset('tips')
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]